app/controllers/admin_users_controller.rb

  def index
    @admin_users = AdminUser.all
---
SELECT * FROM "admin_users"

  def show
    @admin_user = AdminUser.find(params[:id])
---
SELECT * FROM "admin_users" WHERE ("admin_users"."id" = 1)

  def edit
    @admin_user = AdminUser.find(params[:id])
---
SELECT * FROM "admin_users" WHERE ("admin_users"."id" = 1)

  def create
    @admin_user = AdminUser.new(params[:admin_user])

    respond_to do |format|
      if @admin_user.save
---
INSERT INTO "admin_users" ("created_at", "updated_at", "username", "password") VALUES('2010-09-02 07:59:24', '2010-09-02 07:59:24', 'ray', 'lin')