app/controllers/bananas_controller.rb

  def index
    @bananas = Banana.all
---
SELECT * FROM "bananas"

  def show
    @banana = Banana.find(params[:id])
---
SELECT * FROM "bananas" WHERE ("bananas"."id" = 3)

  def edit
    @banana = Banana.find(params[:id])
---
SELECT * FROM "bananas" WHERE ("bananas"."id" = 3)

  def create
    @banana = Banana.new(params[:banana])

    respond_to do |format|
      if @banana.save
---
INSERT INTO "bananas" ("created_at", "updated_at", "user_id", "brown_bananas", "number_of_bananas", "when_brown", "when_bought") VALUES('2010-09-03 03:46:10', '2010-09-03 03:46:10', 4, NULL, 10, '2010-09-03 03:46:00', '2010-09-01 03:46:00')

  def update
    @banana = Banana.find(params[:id])

    respond_to do |format|
      if @banana.update_attributes(params[:banana])
---
SELECT * FROM "bananas" WHERE ("bananas"."id" = 3)
UPDATE "bananas" SET "brown_bananas" = 3, "updated_at" = '2010-09-03 03:53:00' WHERE "id" = 3

  def destroy
    @banana = Banana.find(params[:id])
    @banana.destroy
---
SELECT * FROM "bananas" WHERE ("bananas"."id" = 1)
DELETE FROM "bananas" WHERE "id" = 1