app/controllers/public_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password", "image_path") VALUES('2010-09-02 04:07:33', '2010-09-02 04:07:33', 'ray ', 'lin', NULL)
---
  def create_user
    @user = User.new(params[:user])
    null = ""
    if @user.username == null || @user.password == null
      flash[:notice] = "New user creation failed! You probably didn't fill everything in, dunderhead."
      redirect_to(:action => 'new_user')
    elsif @user.save

INSERT INTO "bananas" ("created_at", "updated_at", "user_id", "brown_bananas", "number_of_bananas", "when_brown", "when_bought") VALUES('2010-09-02 06:52:19', '2010-09-02 06:52:19', 4, 0, 10, NULL, '2010-09-01 00:00:00')
---
  def create_tracker
    if session[:user_id]
      @banana = Banana.new(params[:banana])
      @banana.user_id = session[:user_id]
      @banana.brown_bananas = 0
      if @banana.number_of_bananas == nil  || @banana.number_of_bananas <= 0
        flash[:notice] = "Error!!!! You have to track at least 1 banana! In simpler words, you need to not have no bananas."
        redirect_to(:action => "new_tracker")
      else
          if @banana.save

SELECT * FROM "bananas" WHERE ("bananas"."id" = 2)
UPDATE "bananas" SET "brown_bananas" = 2, "updated_at" = '2010-09-03 04:27:21', "when_brown" = '2010-09-04 00:00:00' WHERE "id" = 4
---
  def create_brown
    @banana = Banana.find(session[:banana_id])

    if @banana.update_attributes(params[:banana])

SELECT * FROM "bananas" WHERE ("bananas"."id" = 2)
DELETE FROM "bananas" WHERE "id" = 2
---
  def delete

    @banana = Banana.find(params[:id])
    if @banana.user_id == session[:user_id]
      @banana.destroy