app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-09-02 07:58:14', "image_path" = '', "username" = 'ray' WHERE "id" = 1